In [28]:
import requests

url = "https://ner-food-ctgsi4wqxa-ew.a.run.app/"
params = {"text":"2 cesars salad and 1 schnitzel and chocolates and milks 2 glasses fanta"}

In [29]:
response = requests.get(url,params).json()

In [30]:
import pandas as pd
pd.DataFrame(response)

,food,food_start,food_end,quantity,quantity_start,quantity_end,unit,unit_start,unit_end
0,Cesars salad,1,14,2,0,1,-1,-1,-1
1,Schnitzel,20,30,1,18,20,-1,-1,-1
2,Chocolates,34,45,-1,-1,-1,-1,-1,-1
3,Milk,49,54,2,55,57,glasses,57,65
4,Fanta,65,71,-1,-1,-1,-1,-1,-1